app/views/gardens/show.html.erb

  <tbody>
    <% @garden.water_reading.take(200).reverse.each do |reading| %>
---
SELECT  "water_readings".* FROM "water_readings" WHERE "water_readings"."garden_id" = ? LIMIT ?  [["garden_id", 1], ["LIMIT", 200]]

  <tbody>
    <% @garden.light_reading.take(200).reverse.each do |reading| %>
---
SELECT  "light_readings".* FROM "light_readings" WHERE "light_readings"."garden_id" = ? LIMIT ?  [["garden_id", 1], ["LIMIT", 200]]