app/controllers/gardens_controller.rb

SELECT  "gardens".* FROM "gardens" WHERE (gardens.name = 'UIOWA Garden') ORDER BY "gardens"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @gardens = current_user_gardens(current_user)
    if(@gardens.size>0)
      redirect_to garden_path(@gardens.first)
    else
      @gardens=Garden.all

SELECT  "water_readings".* FROM "water_readings" WHERE "water_readings"."garden_id" = ? ORDER BY "water_readings"."id" DESC LIMIT ?  [["garden_id", 1], ["LIMIT", 1]]
SELECT  "light_readings".* FROM "light_readings" WHERE "light_readings"."garden_id" = ? ORDER BY "light_readings"."id" DESC LIMIT ?  [["garden_id", 1], ["LIMIT", 1]]
---
  def show
    gon.water_node1 = @garden.water_reading.last.node1
    gon.water_node2 = @garden.water_reading.last.node2
    gon.water_node3 = @garden.water_reading.last.node3
    gon.water_node4 = @garden.water_reading.last.node4
    gon.water_node5 = @garden.water_reading.last.node5
    gon.water_node6 = @garden.water_reading.last.node6
    gon.water_node7 = @garden.water_reading.last.node7
    gon.light_node1 = @garden.light_reading.last.node1

SELECT  "gardens".* FROM "gardens" WHERE "gardens"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "garden_name" = 'UIOWA Garden' WHERE "users"."id" = ?  [["id", 2]]
---
  def register
    @garden = Garden.find(params[:id])
    current_user.update_column(:garden_name, @garden.name)

SELECT  "gardens".* FROM "gardens" WHERE "gardens"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_garden
      @garden = Garden.find(params[:id])