app/controllers/light_readings_controller.rb

SELECT "light_readings".* FROM "light_readings"
---
  def index
    @light_readings = LightReading.all

INSERT INTO "light_readings" ("node1", "node2", "node3", "node4", "node5", "node6", "node7", "node8", "temp", "garden_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @light_reading = LightReading.new(light_reading_params)

    respond_to do |format|
      if @light_reading.save

SELECT  "light_readings".* FROM "light_readings" WHERE "light_readings"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_light_reading
      @light_reading = LightReading.find(params[:id])