app/controllers/water_readings_controller.rb

  def index
    @water_readings = WaterReading.all
---
SELECT "water_readings".* FROM "water_readings"